# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..GetEnumerator Method
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator
```

Visual C++
---
```text
public:
virtual IEnumerator^ GetEnumerator()
```

# ### Implements
IEnumerable..::..GetEnumerator()()()()
# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace